
###==================================###
###  【第1章】数据可视化与R语言      ###
###==================================###


#####================================================================#####
#####  1.2  R软件的初步使用
#####================================================================#####


#####————————————————————————————————#####
##### 给对象赋值并分析
#####————————————————————————————————#####
x <- c(80,87,98,73,100)                 # 将5个数据赋值给对象x
y <- data1_1                            # 将数据框data1_1赋值给对象y


#####————————————————————————————————#####
##### 对象计算和绘图
#####————————————————————————————————#####
x <- c(80,87,98,73,100)                 # 将5个数据赋值给对象x

sum(x)                                  # 计算对象x的总和
mean(x)                                 # 计算对象x的平均数
barplot(x)                              # 绘制x的条形图


#####————————————————————————————————#####
##### 在脚本里写代码
#####————————————————————————————————#####
# 绘制直方图
d <- rnorm(100)                       # 生成100个标准正态分布随机数
hist(d, prob = TRUE, col = "green")   # 绘制直方图
lines(density(d))                     # 为直方图添加核密度曲线


#####————————————————————————————————#####
##### 包的一些操作
#####————————————————————————————————#####
#  安装包
install.packages("ggplot2")                  # 安装ggplot2包
install.packages(c("ggplot2","vcd"))         # 同时安装ggplot2和vcd两个包

#  加载包
library(ggplot2)                             # 加载ggplot2包
# 或
require(ggplot2)                             # 加载ggplot2包

#  显示已安装包的名称
.packages(all.available=TRUE)

#  卸载（删除）安装在R中的包
remove.packages("ggplot2")                   # 从R中彻底删除ggplot2包

#  解除（不是删除）加载到R界面中的包
detach("ggplot2")                            # 解除加载到R界面中的ggplot2包


#####————————————————————————————————#####
##### 查看帮助信息
#####————————————————————————————————#####
help(sum)                                    # 查看mean函数的帮助信息
help(plotmath)                               # 查看R的数学运算符
help(package = "ggplot2")                    # 查看ggplot2包的信息
var                                          # 查看var函数源代码



#####================================================================#####
#####  1.3  R的数据类型及其操作
#####================================================================#####

#####————————————————————————————————#####
##### 创建向量
#####————————————————————————————————#####
# 用c函数创建向量
a <- c(2, 5, 8, 3, 9)                    # 数值型向量
b <- c("甲", "乙", "丙", "丁")           # 字符型向量
c <- c("TRUE", "FALSE", "FALSE", "TRUE") # 逻辑值向量
a; b; c                                  # 运行向量a,b,c，并显示其结果

# 创建向量的其他方法
v1 <- 1:6                                # 产生1~6的等差数列
v2 <- seq(from = 2,to = 4,by = 0.5)      # 在2~4之间产生步长为0.5的等差数列
v3 <- rep(1:3, times = 3)                # 将1~3的向量重复3次
v4 <- rep(1:3, each = 3)                 # 将1~3向量中的每个元素重复3次
v1; v2; v3; v4                           # 运行向量v1,v2,v3,v4

# R的内置函数
LETTERS[1:10]                            # 生成1~10个大写英文字母
letters[1:10]                            # 生成1~10个小写英文字母
month.abb                                # 生成缩写的英文月份
month.name[1:6]                          # 生成全称英文月份1~6月份


#####————————————————————————————————#####
##### 创建矩阵
#####————————————————————————————————#####
# 用matrix函数创建矩阵
v <- 1:6                         # 生成1到6的数值向量
mat <- matrix(v,                 # 创建向量v的矩阵，并命名为mat
              nrow = 2, ncol = 3,# 矩阵行数为2，列数为3
              byrow = TRUE)  
                     # 按行填充矩阵元素（函数默认byrow=FALSE，即按列填充）
mat                  # 显示矩阵mat


#####————————————————————————————————#####
##### 为矩阵添加行名和列名
#####————————————————————————————————#####
# 为矩阵添加行名和列名
rownames(mat) = c("甲", "乙")       # 添加行名
colnames(mat) = c("A", "B", "C")    # 添加行名
mat

# 矩阵转置（使用t函数）
t(mat)


#####————————————————————————————————#####
##### 创建数据框
#####————————————————————————————————#####
# 写入姓名和分数向量
names <- c("刘文涛", "王宇翔", "田思雨", "徐丽娜", "丁文斌")
                                           # 写入学生姓名向量
stat <- c(68, 85, 74, 88, 63)              # 写入各门课程分数向量
math <- c(85, 91, 74, 100, 82)
econ <- c(84, 63, 61, 49, 89)

# 将向量组织成数据框
table1_1 <- data.frame(学生姓名 = names, 统计学 = stat, 
                       数学 = math, 经济学 = econ)
                          # 将数据组织成数据框，并赋值给对象table1_1
table1_1                  # 显示数据框table1_2


#####————————————————————————————————#####
##### 查看数据框
#####————————————————————————————————#####
# 查看数据框
table1_1 <- read.csv("C:/mydata/chap01/table1_1.csv") # 读入数据框table1_1
table1_1                                              # 显示table1_1
head(table1_1, 3)                                     # 查看前3行
tail(table1_1, 3)                                     # 查看后3行

# 查看数据框的行数和列数
nrow(table1_1)                       # 查看table1_1的行数
ncol(table1_1)                       # 查看table1_1的列数
dim(table1_1)                        # 同时查看行数和列数

# 查看数据类型
class(table1_1)

# 查看数据结构
str(table1_1)                       # 查看tabe1_1的数据结构


#####————————————————————————————————#####
##### 访问数据框
#####————————————————————————————————#####
# 访问数据框中的特定行或列
table1_1 <- read.csv("C:/mydata/chap01/table1_1.csv")
table1_1$统计学     # 访问table1_1中的统计学变量，或写成table1_1[,2]

table1_1[ ,2:3]     # 访问table1_1中的第2列至第3列，或写成table1_1[,c(2,3)]

table1_1[,c(1, 3)]  # 访问table1_1中的第1列和第3列
table1_1[3,]        # 访问table1_1中的第3行
table1_1[c(2, 4),]  # 访问table1_1中的第2行和第4行

table1_1[3, 2]      # 访问table1_1中的第3行和第2列对应的单元格

table1_1[c(1, 3),c(1, 2:3)] 
                    # 访问table1_1中的第1行和第3行、第1列和第2至第3列


#####————————————————————————————————#####
##### 数据框合并（合并要有意义）
#####————————————————————————————————#####
table1_1 <- read.csv("C:/mydata/chap01/table1_1.csv")    # 读入数据
table1_2 <- read.csv("C:/mydata/chap01/table1_2.csv")        

mytable <- rbind(table1_1, table1_2)           # 按行合并数据框
head(mytable, 3)                               # 显示前3行


#####————————————————————————————————#####
##### 数据框排序
#####————————————————————————————————#####
# 使用sort_by函数根据某个列变量对整个数据框排序
table1_1 <- read.csv("C:/mydata/chap01/table1_1.csv")

sort_by(table1_1, table1_1$姓名)         # 按姓名升序对整个数据框排序
## 或写成sort_by(table1_1, ~姓名)

# 使用dplyr包中的arrange函数根据某个列变量对整个数据框排序
library(dplyr)                          # 加载包
arrange(table1_1, desc(数学))           # 按数学分数降序对整个数据框排序


#####————————————————————————————————#####
##### 修改、增加列和汇总计算
#####————————————————————————————————#####
# 使用mutate函数在数据框中添加新列
library(dplyr)                 # 加载包
library(reshape2)              # 加载包
table1_1 <- read.csv("C:/mydata/chap01/table1_1.csv")

# 使用mutate函数在数据框中添加新列
df1 <- table1_1 %>% 
 mutate(性别 = c("男", "男", "女", "女", "男"), .after = 姓名)%>%
                                                # 在姓名列后插入性别列
        mutate(总分数 = 统计学 + 数学 + 经济学, 
        平均分数 = round((统计学 + 数学 + 经济学)/3, 2))  
                               # 在最右侧插入总分数和平均分数(保留2为小数)
df1

# 使用summarise_if函数对满足条件的数值列进行汇总（只返回汇总结果）
df2<-table1_1 %>% 
  summarise_if(is.numeric, mean)  # 计算所有数值列的平均数
df2

# 使用summarise函数对数值列分组进行汇总（只返回分组变量和汇总结果）
df3 <- table1_1 %>% mutate(性别 = c("男", "男", "女", "女", "男"), 
                           .after= 姓名) %>%   # 在姓名列后插入性别列
    melt(id.vars = c("姓名", "性别"), variable.name = "课程", 
                     value.name = "分数")
my_stat1 <- group_by(df3, 性别) %>%                # 按姓名分组
    summarise(平均数 = mean(分数), 标准差 = sd(分数), 
              变异系数 = sd(分数)/mean(分数)) %>%  # 计算统计量
    ungroup()             # 取消分组（以便继续操作该数据框而不受分组影响）
my_stat1

# 按性别分组使用mutate函数插入汇总统计量列（可保留数据中的原始变量）
my_stat2 <- group_by(df3, 姓名) %>%        # 按性别分组
    mutate(平均数 = mean(分数), 标准差 = sd(分数), 
           变异系数 = sd(分数)/mean(分数)) # 插入统计量列
head(my_stat2, 3)                          # 显示前3行


#####————————————————————————————————#####
##### 因子及其操作
#####————————————————————————————————#####
# 创建因子
a <- c("金融", "地产", "医药", "医药", "金融", "医药") # 创建向量a
f1 <- factor(a); f1                                # 将向量a编码为因子

# 将因子转换为数值
as.numeric(f1)                                     # 将因子转换为数值

# 将无序因子转换为有序因子或数值
b <- c("很好", "好", "一般", "差", "很差")         # 创建向量b
f2 <- factor(b, ordered=TRUE, 
             levels = c("很好", "好", "一般", "差", "很差"))
f2                                                 # 将向量b编码为有序因子
as.numeric(f2)                                     # 将因子转换为数值



#####================================================================#####
#####  1.4  R语言数据处理
#####================================================================#####

#####————————————————————————————————#####
##### 读取csv格式数据
#####————————————————————————————————#####
# 读取编码格式为UTF-8的csv文件（含有标题） 
table1_1 <- read.csv("C:/mydata/chap01/table1_1.csv",fileEncoding="UTF-8")
                                          # 读取编码格式为UTF-8的csv文件
table1_1

# 读取编码格式为GBK的csv文件（含有标题） 
table1_1 <- read.csv("C:/mydata/chap01/table1_1.csv",fileEncoding="GBK") 
                                          # 读取编码格式为GBK的csv文件
table1_1                                  # 显示数据table1_2


#####————————————————————————————————#####
##### 保存为csv格式（UTF-8或GBK）
#####————————————————————————————————#####
#  存为编码格式为GBK的csv文件 
write.csv(table1_3, file="C:/mydata/chap01/table1_3.csv", 
          fileEncoding = "GBK")          # 存为编码格式为GBK的csv文件
                                        

#  存为编码格式为UTF-8的csv文件 
write.csv(table1_3, file = "C:/mydata/chap01/table1_3.csv)
                                        # 默认存为编码格式为UTF-8的csv文件
write.csv(table1_3, file ="C:/mydata/chap01/table1_3.csv",
          fileEncoding="UTF-8")


#####————————————————————————————————#####
##### 数据抽样和筛选——抽取随机样本——sample函数
#####————————————————————————————————#####
df <- read.csv("C:/mydata/chap01/data1_1.csv")
# 随机抽取5个不同专业组成一个样本
n1 <- sample(df$专业, size=5); n1                # 无放回抽取5个不同专业
n2 <- sample(df$专业, size=5, replace=TRUE); n2  # 有放回抽取5个不同专业

# 随机抽取10个网购金额组成一个样本
n3 <- sample(df$网购金额, size= 10); n3          # 无放回抽取10个网购金额
n4 <- sample(df$网购金额, size= 10, replace = TRUE); n4  
                                                 # 有放回抽取10个网购金额


#####————————————————————————————————#####
##### 数据筛选
#####————————————————————————————————#####
# 使用dplyr包中的filter函数筛选出符合特定条件的数据
df <- read.csv("C:/mydata/chap01/data1_1.csv")
library(dplyr)
filter(df, 网购金额 >= 800)   # 筛选网购金额大于等于800的所有学生 

filter(df,性别 == "男" & 网购金额>= 700 & 网购金额 <= 800) 
                              # 筛选出网购金额在700~800之间的女生

filter(df, 性别 == "男" & 专业== "金融学" & 在读学位 == "博士") 
                              # 筛选出金融学专业的男博士

df <- filter(df, 在读学位 %in% c("硕士", "博士")) 
                              # 选出在读学位中的硕士和博士
head(df, 3)                                  # 显示前3行

# 使用dplyr包中的top_n函数选出最大的n个数据
 top_n(df, 3, 网购金额)       # 筛选出网购金额最高的3人

# 使用base包中的subset函数筛选出符合特定条件的数据
subset(df, 性别 == "女" & 专业 == "会计学" & 网购金额 >= 700) 
                              # 筛选出会计学专业网购金额大于等于700的女生

subset(df, 网购金额 > 600 & 专业 == "管理学" & 性别 == "男") 
                              # 筛选出网购金额大于600的管理学专业的男生

###  注：在相同条件下，filter函数和subset函数返回的结果相同，只是subset函数还返回样本的行号


#####————————————————————————————————#####
##### 生成随机数
#####————————————————————————————————#####
# 生成不同分布的随机数
rnorm(n=5, mean = 0, sd = 1)  # 产生5个标准正态分布随机数
set.seed(15)                  # 设置随机数种子
rnorm(n=5, mean = 50, sd = 5) # 产生5个均值为50、标准差为5的正态分布随机数
runif(n=5, min = 0, max = 10) # 在0到10之间产生5个均匀分布随机数
rchisq(n=5, df = 10)          # 产生5个自由度为10 的卡方分布随机数



#####================================================================#####
#####  数据类型的转换
#####================================================================#####

#####————————————————————————————————#####
##### 将变量转换为向量
#####————————————————————————————————#####
# 将统计学分数转化成向量
table1_1 <- read.csv("C:/mydata/chap01/table1_1.csv")
v1 <- as.vector(table1_1$统计学); v1

# 统计学分数和数学分数合并转换为向量
v2 <- as.vector(c(table1_1$统计学, table1_1$数学)); v2

# 将数据框转换为向量
v3 <- as.vector(as.matrix(table1_1[ ,2:4])); v3 


#####————————————————————————————————#####
##### 将数据框转换为矩阵
#####————————————————————————————————#####
# 将数据框table1_2转换为矩阵mat
table1_1 <- read.csv("C:/mydata/chap01/table1_1.csv")
mat <- as.matrix(table1_1[ ,2:4])        # 将table1_1中的2~4列换为矩阵mat
rownames(mat)=table1_1[ ,1]              # 矩阵的行名为table1_1第1列的名称
mat                                      # 显示矩阵

## 将矩阵转化成数据框，并给数据框添加上列（变量）名称（姓名）
library(tidyverse)
df <- as.data.frame(mat)%>%          # 将矩阵转换成数据框df
    rownames_to_column("姓名")       # 加上列名（姓名）

# 或写成
df <- as.data.frame(mat)             # 将矩阵转换成数据框df
rownames_to_column(df, var = "姓名")

# 注
这些函数允许检测数据框是否有行名(has_rownames())，移除它们(remove_rownames())，或者在显式列(rownames_to_column()和column_to_rownames())之间来回转换它们。还包括rowid_to_column()，它在从1开始的升序行id的数据帧的开头添加一列。请注意，这将删除任何现有的行名。


#####————————————————————————————————#####
##### 将短格式数据转换为长格式
#####————————————————————————————————#####
# 使用reshape2包中的melt函数融合成长格式
table1_1 <- read.csv("C:/mydata/chap01/table1_1.csv")
library(reshape2)                              # 加载reshape2包
df1<-melt(table1_1, id.vars = "姓名", variable.name = "课程",
          value.name = "分数")
     # 融合table1_2与id变量，并命名variable.name="课程",value.name="分数"
head(df1, 3)                        # 显示df1的前3行

# 使用tidyr包中的gather函数融合成长格式
library(tidyr)                       # 加载tidyr包
df2 <- gather(table1_1, 
              key = "课程", value = "分数", "统计学", "数学", "经济学") 
                                     # key为融合后的变量名称
df2

# 使用tidyr包中的pread函数将长格式转换成短格式
## dd <- spread(df2, key = "课程", value = 分数)       # 未运行


#####————————————————————————————————#####
##### 将数据框转换成HTML表格
#####————————————————————————————————#####
# 使用rempsyc包中的nice_table函数iang数据框转换成flextable表格对象
library(rempsyc)
library(dplyr)
table1_1 <- read.csv("C:/mydata/chap01/table1_1.csv")

df <- table1_1 %>% mutate(平均分数 = (统计学 + 数学 + 经济学)/3) 
                                              # 添加平均分数一列
tab<-nice_table(df, width = 0.3)              # 生成HTML表格，列宽为0.3
tab

## 存为Word文档
## flextable::save_as_docx(tab, path = "C:/mydata/mytab.docx")



#####================================================================#####
#####  生成频数表
#####================================================================#####

#####————————————————————————————————#####
##### 生成一维频数表
#####————————————————————————————————#####
# 生成在读学位的一维频数表
data1_1 <- read.csv("C:/mydata/chap01/data1_1.csv")
tab1 <- table(data1_1$在读学位); tab1      # 生成频数表

prop.table(tab1)*100                       # 将频数表转化成百分比表


#####————————————————————————————————#####
##### 生成二维列联表
#####————————————————————————————————#####
# 生成性别与专业的二维列联表
data1_1 <- read.csv("C:/mydata/chap01/data1_1.csv")
attach(data1_1)                    # 绑定数据框data1_1

tab2 <- table(性别, 专业); tab2    # 生成性别和专业的二维列联表

addmargins(tab2)                   # 为列联表添加边际和

addmargins(prop.table(tab2)*100)   # 将列联表转换成百分比表


#####————————————————————————————————#####
##### 生成多维列联表——使用ftable函数
#####————————————————————————————————#####
# 使用ftable函数生成例1-2的多维列联表
data1_1 <- read.csv("C:/mydata/chap01/data1_1.csv")
tab3 <- ftable(data1_1, 
               row.vars = c("性别", "专业"), col.vars = "在读学位")
                                 # 行变量为性别和专业，列变量为在读学位
tab3

# 为列联表添加边际和
ftable(addmargins(table(data1_1$性别, data1_1$专业, data1_1$在读学位)))
                                       
# 使用vcd包中的structable函数生成例1-2的多维列联表
data1_1 <- read.csv("C:/mydata/chap01/data1_1.csv")
library(vcd)
structable(性别 + 专业 ~ 在读学位, data = data1_1)# 不同表达式产生不同形式的多维表

# 补充
structable(data1_1[,1:3],direction=c("h","h","v")) # 指定态度变量放在列
structable(data1_1[,1:3],direction=c("v","h","v")) # 指定性别变量放在列


#####————————————————————————————————#####
##### 将列联表转化成数据框
#####————————————————————————————————#####
data1_1 <- read.csv("C:/mydata/chap01/data1_1.csv")
library(DescTools)
library(dplyr)

# 将列联表转化成原始数据框
mytable <- ftable(data1_1[ ,1:3])    # 选择变量1~3生成多维列联表
df<-Untable(mytable)                 # 将列联表转化成原始数据框
head(df, 3)                          # 显示前3行

# 或Untable(table(data1_1[ ,1:3]))   # 将列联表转化成数据框

# 将列联表转化成带有交叉类别频数的数据框
library(dplyr)                                        # 加载包
df <- data1_1 %>% select(性别, 专业, 在读学位) %>%    # 选取列变量
ftable() %>%                                    # 使用ftable函数生成多维表
as.data.frame() %>%                             # 将多维表转换成数据框
rename(频数 = Freq)                             # 将Freq重新命名为频数
head(3)                                         # 查看数据框前3行
df

# 使用table函数生成列联表，使用reshape2包中的melt函数融合成数据框
library(reshape2)
df<-data1_1 %>% 
    select(性别, 专业, 在读学位) %>%
    table() %>% 
    melt() %>% 
    rename(频数=value)


#####————————————————————————————————#####
##### 数值数据类别化
#####————————————————————————————————#####
# 使用Freq函数的默认分组（含上限值）
library(DescTools)
data1_1 <- read.csv("C:/mydata/chap01/data1_1.csv")
tab 1<- Freq(data1_1$网购金额)
tab1

# 指定组距=150（不含上限值）
tab2 <- Freq(data1_1$网购金额, 
             breaks = c(0, 150, 300, 450, 600, 750, 900), right=FALSE)
                                      # 指定组距=150，不含上限值
tab2 <- data.frame(分组 = tab2$level, 
                   频数 = tab2$freq, 
                   频数百分比 = tab2$perc*100,
                   累积频数 = tab2$cumfreq, 
                   累积百分比 = tab2$cumperc*100)
                                      # 重新命名频数表中的变量名

print(tab2, digits = 4)               # 使用print函数打印结果并确定小数位数




#####————————————————————————————————#####
#####————————————————————————————————#####
#####————————————————————————————————#####
#####  END
#####————————————————————————————————#####
#####————————————————————————————————#####
#####————————————————————————————————#####













